Working with a sample data

In [11]:
import pandas as pd

In [12]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Alice", "charlie"],
    "Age": [25, 30, 35, 40, 25, 35],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "New York", "San Francisco"]
}

In [13]:
df = pd.DataFrame(data)
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30    Los Angeles
2  Charlie   35        Chicago
3    David   40        Houston
4    Alice   25       New York
5  charlie   35  San Francisco

In [ ]:
# df["duplicated"] = df.duplicated() # to see the duplicates
# df

In [17]:
df.drop_duplicates(inplace=True)
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30    Los Angeles
2  Charlie   35        Chicago
3    David   40        Houston
5  charlie   35  San Francisco

Now working with our actual dataset

In [18]:
dataset = pd.read_csv("loan.csv")
dataset.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849.0,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,No,4583.0,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0.0,Graduate,Yes,3000.0,0.0,66.0,360.0,1.0,Urban,Y

In [20]:
dataset.shape

(598, 13)

In [21]:
dataset.drop_duplicates(inplace=True) # this will remove all duplicate rows and inplace the changes to the original DataFrame
dataset.shape  # check the shape again to see if duplicates were removed

(598, 13)

That means our data has no duplicates